"""Однострочники"""
# a = 42
# b = 73
# a, b = b, a
# print(f'{a = }\t{b = }')

# Распаковка колекции

# a, b, c = input("Три символа: ")
# print(f'{a=} {b=} {c=}')

#_________________________________________________

# a, b, c = {"один", "два", "три", "четыре", "пять"}
# print(f'{a=} {b=} {c=}') # ValueError: too many values to unpack(expected 3)

#_________________________________________________________

# data = ["один", "два", "три", "четыре", "пять", "шесть", "семь",]
# a, b, c, *d = data
# print(f'{a=} {b=} {c=} {d=}')
# a, b, *c, d = data
# print(f'{a=} {b=} {c=} {d=}')
# a, *b, c, d = data
# print(f'{a=} {b=} {c=} {d=}')
# *a, b, c, d = data
# print(f'{a=} {b=} {c=} {d=}')

#___________________________________________________________________

# link = 'https://docs.python.org/3/faq/programming.html#how-can-i-pass-optional-or-keyword-parameters-from-one-function-to-another'
# prefix, *_, suffix = link.split('/')
#
# print(prefix, suffix)

#_______________________________________________________________________

# data = [2, 4, 6, 8, 10, ]
# for item in data:
#     print(item, end='\t')

#__________________________________________________________
# print()
# data = [2, 4, 6, 8, 10, ]
# print(*data, sep='\t')

# Множественное присваивание

# a = b = c = 0 # хорошо
# a += 42
# print(f'{a=} {b=} {c=}')

#____________________________________________________________

# a = b = c = {1, 2, 3} # плохо
# a.add(42)
# print(f'{a=} {b=} {c=}')

# )_________________________________________

# a, b, c = 1, 2, 3
# print(f'{a=} {b=} {c=}')
#
#
# t = 1, 2, 3
# print(f'{t=}, {type(t)}') # кортеж

# Множественное сравнение


# a = b = c = 42
# # if a == b and b == c:
# if a == b == c:
#     print('Полное совпадение')
#
#
# if a < b < c:
#     print('b больше a и меньше c')


# Плохие однострочники

a = 12; b = 42; c = 73
if a < b < c: b = None; print('Ужасный код')