# Задание №1
# Создайте несколько переменных разных типов.
# Проверьте к какому типу относятся созданные переменные.

a = 7
b = 8.9
c = "text"
d = {1, 3, 98}
e = True

print(type(a))
print(type(b))
print(type(c))
print(type(d))
print(type(e))

