"""Вспомните какие модули вы уже проходили на курсе.
Создайте файл, в котором вы импортируете встроенные в
модуль функции под псевдонимами. (3-7 строк импорта)."""

import random as rnd
from math import sqrt
from random import randint as r_int
from random import uniform as r_float
from random import choice as r_sequence
from random import shuffle as r_shuf

print(rnd.randint(1, 20))
print(sqrt(9))

